app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY release_date
---
  def index

    @sort = params['sort']
    @ratings = params[:ratings]
    @all_ratings = Movie.ratings

    if @ratings.nil?
      @ratings_show = @all_ratings
    else
      @ratings_show = @ratings
    end

    if @ratings.nil? && @sort.nil?
      @movies = Movie.all

    elsif @ratings.nil? && !@sort.nil?
      @movies = Movie.find(:all, :order => 'title') if params['sort'] == 'title'
      @movies = Movie.find(:all, :order => 'release_date') if params['sort'] == 'release_date'

    elsif !@ratings.nil? && @sort.nil?
      @movies = Movie.find_all_by_rating(@ratings.keys)